# OpenConnectedFaceSet Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
TessellatedShapeBuilder..::..OpenConnectedFaceSet Method
TessellatedShapeBuilder Class See Also
---
Opens a new connected face set.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2015
# Syntax
C#
---
```text
public void OpenConnectedFaceSet(
	bool isSolid
)
```

Visual Basic
---
```text
Public Sub OpenConnectedFaceSet ( _
	isSolid As Boolean _
)
```

Visual C++
---
```text
public:
void OpenConnectedFaceSet(
	bool isSolid
)
```

# ### Parameters
isSolid
    Type: System..::..Boolean Whether the face set, which is being open, should be build as a solid or as a void.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..InvalidOperationException | A face set is open and a geometry cannot be build until it is closed. |

# See Also
TessellatedShapeBuilder Class
Autodesk.Revit.DB Namespace